In [1]:
import pandas as pd 
import numpy as np

In [2]:
dict = {'First Score':[100,90,np.nan,95],
'Second Score':[30,np.nan,45,56],
'Third Score': [52,40,80,98],
'Fourth Score': [np.nan, np.nan, np.nan, 65]}

df = pd.DataFrame(dict)
df.head()

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52           NaN
1         90.0           NaN           40           NaN
2          NaN          45.0           80           NaN
3         95.0          56.0           98          65.0

In [3]:
df.dropna()  #로우행제거

   First Score  Second Score  Third Score  Fourth Score
3         95.0          56.0           98          65.0

In [4]:
df.dropna(axis=0, how='any') #axis=0세로진행하면서 로우행삭제

   First Score  Second Score  Third Score  Fourth Score
3         95.0          56.0           98          65.0

In [5]:
df.dropna(axis=1, how='any') #axis=1가로진행하면서 컬럼열삭제

   Third Score
0           52
1           40
2           80
3           98

In [8]:
dict = {'First Score':[100,np.nan,np.nan,95],
'Second Score':[np.nan,np.nan,np.nan,np.nan],
'Third Score': [52,np.nan,80,98],
'Fourth Score': [np.nan, np.nan, np.nan, 65]}

df2 = pd.DataFrame(dict)
df2

   First Score  Second Score  Third Score  Fourth Score
0        100.0           NaN         52.0           NaN
1          NaN           NaN          NaN           NaN
2          NaN           NaN         80.0           NaN
3         95.0           NaN         98.0          65.0

In [9]:
df2.dropna(how='all')

   First Score  Second Score  Third Score  Fourth Score
0        100.0           NaN         52.0           NaN
2          NaN           NaN         80.0           NaN
3         95.0           NaN         98.0          65.0

In [13]:
df2.dropna(axis=1, how='all')

   First Score  Third Score  Fourth Score
0        100.0         52.0           NaN
1          NaN          NaN           NaN
2          NaN         80.0           NaN
3         95.0         98.0          65.0

In [17]:
df2.dropna(thresh=1) #?? Nan값 4개가 없어짐??? 늬에?

   First Score  Second Score  Third Score  Fourth Score
0        100.0           NaN         52.0           NaN
2          NaN           NaN         80.0           NaN
3         95.0           NaN         98.0          65.0

In [18]:
df2.dropna(thresh=2) #

   First Score  Second Score  Third Score  Fourth Score
0        100.0           NaN         52.0           NaN
3         95.0           NaN         98.0          65.0